Revit 2024 API
Transform Methods
The Transform type exposes the following members.
Methods
Name | Description
AlmostEqual
Determines whether this transformation and the specified transformation are the same within the tolerance (1.0e-09).
CreateReflection
 Creates a transform that represents a reflection across the given plane.
CreateRotation
 Creates a transform that represents a rotation about the given axis at (0, 0, 0).
CreateRotationAtPoint
 Creates a transform that represents a rotation about the given axis at the specified point.
CreateTranslation
 Creates a transform that represents a translation via the specified vector.
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Multiply
Multiplies this transformation by the specified transformation and returns the result.
OfPoint
Applies the transformation to the point and returns the result.
OfVector
Applies the transform to the vector
ScaleBasis
Scales the basis vectors of this transformation and returns the result.
ScaleBasisAndOrigin
Scales the basis vectors and the origin of this transformation and returns the result.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
Transform Class
Autodesk.Revit.DB Namespace